
## Terraform Plan 📖
<details>
<summary>Click to expand</summary>

```HCL

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      ~ clone                  = "packer-debian-13.0.0-20250812140623" -> "packer-debian-13.0.0-20250813080527" # forces replacement
      - cores                  = 0 -> null
      ~ current_node           = "pve" -> (known after apply)
      ~ default_ipv4_address   = "10.9.9.50" -> (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "pve/qemu/200" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "kube-master-01"
      - numa                   = false -> null
      - qemu_os                = "l26" -> null
      ~ reboot_required        = false -> (known after apply)
      - sockets                = 0 -> null
      ~ ssh_host               = "10.9.9.50" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = (sensitive value)
      ~ tags                   = "k3s;master" -> "k3s,master"
      ~ unused_disk            = [] -> (known after apply)
      - vcpus                  = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:28:54:7a" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:63:b1:e3" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "180ca313-dc95-4eb4-b2db-2ce3012e4f12" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      ~ clone                  = "packer-debian-13.0.0-20250812140623" -> "packer-debian-13.0.0-20250813080527" # forces replacement
      - cores                  = 0 -> null
      ~ current_node           = "pve" -> (known after apply)
      ~ default_ipv4_address   = "10.9.9.51" -> (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "pve/qemu/201" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "kube-worker-01"
      - numa                   = false -> null
      - qemu_os                = "l26" -> null
      ~ reboot_required        = false -> (known after apply)
      - sockets                = 0 -> null
      ~ ssh_host               = "10.9.9.51" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = (sensitive value)
      ~ tags                   = "k3s;worker" -> "k3s,worker"
      ~ unused_disk            = [] -> (known after apply)
      - vcpus                  = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:e8:8b:30" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:aa:41:cb" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "2478875a-c82a-4f31-88ac-a5f40ab46e25" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk               = (known after apply)
      ~ clone                  = "packer-debian-13.0.0-20250812140623" -> "packer-debian-13.0.0-20250813080527" # forces replacement
      - cores                  = 0 -> null
      ~ current_node           = "pve" -> (known after apply)
      ~ default_ipv4_address   = "10.9.9.52" -> (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "pve/qemu/202" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "kube-worker-02"
      - numa                   = false -> null
      - qemu_os                = "l26" -> null
      ~ reboot_required        = false -> (known after apply)
      - sockets                = 0 -> null
      ~ ssh_host               = "10.9.9.52" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = (sensitive value)
      ~ tags                   = "k3s;worker" -> "k3s,worker"
      ~ unused_disk            = [] -> (known after apply)
      - vcpus                  = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:00:06:f1" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:69:36:27" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "fa02d1fe-228e-4221-aadc-75180e37c078" -> null
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>

*Pusher: @MrStarktastic, Action: `pull_request`*